'use client'
import { DialogFooter } from '@/components/ui/dialog'
import { Dialog, DialogTrigger, DialogContent, DialogTitle } from '@radix-ui/react-dialog'
import { ArrowDown } from 'lucide-react'
import React from 'react'

function DialogRole() {
    return (
        <Dialog>
            <DialogTrigger>
                <button className='w-[528px] bg-purple-500 text-2xl font-semibold text-white py-4 rounded-2xl'>เข้าสู่ระบบ</button>
                {/* <Button title='เข้าสู่ระบบ' /> */}
            </DialogTrigger>
            <DialogContent className='max-w-[calc(100vw-48px)] lg:space-y-4 p-4 rounded-3xl'>
                <DialogTitle className='text-center flex flex-col gap-1'>
                    <span className='lg:text-[32px]'>ข้อกำหนดและเงื่อนไข</span>
                    <span className='lg:text-[28px]'>Term and Conditions</span>
                </DialogTitle>
                <div className='bg-[#F1F1E8] relative rounded-lg lg:rounded-3xl p-4 max-h-[calc(100vh-20rem)] lg:max-h-full min-h-[400px] overflow-hidden overflow-y-auto'>
                    <p className='h-full'>
                        “ข้อมูลส่วนบุคคล” หมายถึง ข้อมูลเกี่ยวกับบุคคลซึ่งทำให้สามารถระบุตัวบุคคลนั้นได้ไม่ว่าทางตรงหรือทางอ้อม แต่ไม่รวมถึงข้อมูลของผู้ถึงแก่กรรมโดยเฉพาะ
                        “ข้อมูลส่วนบุคคลที่อ่อนไหว” หมายถึง ข้อมูลส่วนบุคคลที่เกี่ยวกับเชื้อชาติ เผ่าพันธุ์ ความคิดเห็นทางการเมือง ความเชื่อในลัทธิ ศาสนาหรือปรัชญา พฤติกรรมทางเพศ ประวัติอาชญากรรม ข้อมูลสุขภาพ ความพิการ ข้อมูลสหภาพแรงงาน ข้อมูลพันธุกรรม ข้อมูลชีวภาพ (เช่น ข้อมูลภาพจำลองใบหน้า ข้อมูลจำลองม่านตา ข้อมูลจำลองลายนิ้วมือ) หรือข้อมูลอื่นใดที่กระทบต่อเจ้าของข้อมูลส่วนบุคคลในทำนองเดียวกันตามที่คณะกรรมการคุ้มครองข้อมูลส่วนบุคคลประกาศกำหนด
                        “ประมวลผล” หมายถึง เก็บรวบรวม ใช้ หรือเปิดเผย
                        “ผู้ควบคุมข้อมูลส่วนบุคคล” หมายถึง บุคคลหรือนิติบุคคลที่มีอํานาจในการตัดสินใจเกี่ยวกับการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคล
                        “ผู้ประมวลผลข้อมูลส่วนบุคคล” หมายถึง บุคคลหรือนิติบุคคลซึ่งดำเนินการเกี่ยวกับการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลตามคำสั่งหรือในนามของผู้ควบคุมข้อมูลส่วนบุคคล ทั้งนี้ บุคคลหรือนิติบุคคลซึ่งดำเนินการดังกล่าวไม่เป็นผู้ควบคุมข้อมูลส่วนบุคคล

                        สภาเภสัชกรรม หมายถึง องค์กรที่เป็น ตัวแทนของผู้ประกอบวิชาชีพเภสัชกรรมในประเทศไทย มี วัตถุประสงค์และอำนาจ หน้าที่ตามที่บัญญัติไว้ในพระราชบัญญัติวิชาชีพเภสัชกรรม พ.ศ.2537
                        “ข้อมูลส่วนบุคคล” หมายถึง ข้อมูลเกี่ยวกับบุคคลซึ่งทำให้สามารถระบุตัวบุคคลนั้นได้ไม่ว่าทางตรงหรือทางอ้อม แต่ไม่รวมถึงข้อมูลของผู้ถึงแก่กรรมโดยเฉพาะ
                        “ข้อมูลส่วนบุคคลที่อ่อนไหว” หมายถึง ข้อมูลส่วนบุคคลที่เกี่ยวกับเชื้อชาติ เผ่าพันธุ์ ความคิดเห็นทางการเมือง ความเชื่อในลัทธิ ศาสนาหรือปรัชญา พฤติกรรมทางเพศ ประวัติอาชญากรรม ข้อมูลสุขภาพ ความพิการ ข้อมูลสหภาพแรงงาน ข้อมูลพันธุกรรม ข้อมูลชีวภาพ (เช่น ข้อมูลภาพจำลองใบหน้า ข้อมูลจำลองม่านตา ข้อมูลจำลองลายนิ้วมือ) หรือข้อมูลอื่นใดที่กระทบต่อเจ้าของข้อมูลส่วนบุคคลในทำนองเดียวกันตามที่คณะกรรมการคุ้มครองข้อมูลส่วนบุคคลประกาศกำหนด
                        “ประมวลผล” หมายถึง เก็บรวบรวม ใช้ หรือเปิดเผย
                        “ผู้ควบคุมข้อมูลส่วนบุคคล” หมายถึง บุคคลหรือนิติบุคคลที่มีอํานาจในการตัดสินใจเกี่ยวกับการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคล
                        “ผู้ประมวลผลข้อมูลส่วนบุคคล” หมายถึง บุคคลหรือนิติบุคคลซึ่งดำเนินการเกี่ยวกับการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลตามคำสั่งหรือในนามของผู้ควบคุมข้อมูลส่วนบุคคล ทั้งนี้ บุคคลหรือนิติบุคคลซึ่งดำเนินการดังกล่าวไม่เป็นผู้ควบคุมข้อมูลส่วนบุคคล

                        สภาเภสัชกรรม หมายถึง องค์กรที่เป็น ตัวแทนของผู้ประกอบวิชาชีพเภสัชกรรมในประเทศไทย มี วัตถุประสงค์และอำนาจ หน้าที่ตามที่บัญญัติไว้ในพระราชบัญญัติวิชาชีพเภสัชกรรม พ.ศ.2537
                    </p>
                    <div className='grid place-content-center fixed bottom-[11rem] md:bottom-[7rem] lg:bottom-[8rem] right-8 w-14 aspect-square rounded-full bg-[#464646]'>
                        <ArrowDown size={32} color='white' />
                    </div>
                </div>
                <DialogFooter className='flex gap-4 lg:gap-8 !place-self-center !justify-center w-full font-semibold'>
                    <button className='border w-full lg:w-[305px] p-4 rounded-2xl lg:text-2xl text-[#23260D]'>
                        ไม่ยินยอม
                    </button>
                    <button
                        onClick={() => { console.log("OK") }}
                        className='border w-full lg:w-[305px] p-4 rounded-2xl lg:text-2xl text-[#ffffff] bg-gradient-to-r from-[#80862A] to-[#4F5321] disabled:opacity-50 disabled:bg-[#C1C457]'>
                        ยินยอม
                    </button>
                </DialogFooter>
            </DialogContent>
        </Dialog>
    )
}

export default DialogRole