"use client";

import icon from "@/assets/icons/tele.svg";
import Image from "next/image";
import StepLogin from "./_components/step-login";
import Wrapper from "@/components/ui/Wrapper";
import {
  Dialog,
  DialogContent,
  DialogFooter,
  DialogTitle,
  DialogTrigger,
} from "@/components/ui/dialog";
import { ArrowDown } from "lucide-react";
import { useRouter } from "next/navigation";
import { DialogClose } from "@radix-ui/react-dialog";
import { useEffect, useRef, useState } from "react";

export default function Home() {
  const router = useRouter();
  const ref = useRef<HTMLDivElement>(null);
  const [isOk, setIsOk] = useState<boolean>(false);

  const scrollToRef = () => {
    if (ref.current) {
      ref.current.scrollTo({ top: ref.current.scrollHeight, behavior: "smooth" });
    }
  };

  const handleScroll = () => {
    if (!ref.current) {
      setIsOk(true);
      return;
    }

    const { scrollTop, scrollHeight, clientHeight } = ref.current;
    if (scrollTop + clientHeight >= scrollHeight - 5) {
      setIsOk(true);
    }
  };

  useEffect(() => {
    const element = ref.current;
    if (!element) return;

    const handleScroll = () => {
      const { scrollTop, scrollHeight, clientHeight } = element;
      setIsOk(scrollTop + clientHeight >= scrollHeight - 5);
    };

    element.addEventListener("scroll", handleScroll);
    handleScroll();

    return () => {
      element.removeEventListener("scroll", handleScroll);
    };
  }, []);

  return (
    <>
      <Wrapper>
        <div className="flex-col !p-4 lg:content-center justify-self-center h-full">
          <div className="space-y-4 md:space-y-2 2xl:space-y-4 flex flex-col items-center">
            <Image
              src={icon}
              alt="icon"
              className="w-[100px] h-[100px] md:w-[120px] md:h-[120px] 2xl:w-[140px] 2xl:h-[140px]"
            />
            <div className="text-standard text-center space-y-6 md:!mt-4 2xl:!mt-8">
              <div className="font-semibold text-[#23260D]">
                <h1 className="text-2xl md:text-xl lg:text-3xl 2xl:text-[40px]">
                  ระบบประชุมสภาเภสัชกรรม
                </h1>
                <span className="text-xl md:text-lg lg:text-xl 2xl:text-2xl">
                  the Pharmacy Council of Thailand <br />
                  Meeting System
                </span>
              </div>
              <div className="space-y-8 2xl:space-y-10">
                <h6 className="text-lg md:text-2xl font-semibold text-[#5D6222]">
                  ขั้นตอนการเข้าห้องประชุม
                </h6>
                <StepLogin />
              </div>
            </div>
          </div>
          <div className="space-y-6 flex flex-col items-center 2xl:space-y-8">
            <Dialog>
              <DialogTrigger className="flex relative w-full justify-center items-center mt-12 md:mt-8 2xl:mt-12 lg:w-[528px] bg-gradient-main text-2xl font-semibold text-white py-4 rounded-2xl">
                <span>เข้าสู่ระบบ</span>
              </DialogTrigger>
              <DialogContent
                aria-describedby="เงื่อนไขและข้อกำหนด"
                className="max-w-[calc(100vw-48px)] lg:space-y-4 p-4 rounded-3xl"
              >
                <DialogTitle className="text-center flex flex-col gap-1">
                  <span className="lg:text-[32px]">
                    ข้อกำหนดและเงื่อนไขในการเข้าร่วมประชุมสภาเภสัชกรรมแบบถ่ายทอดสด (Live Streaming)
                  </span>
                </DialogTitle>
                <div
                  ref={ref}
                  onScroll={handleScroll}
                  className="bg-[#F1F1E8] relative rounded-lg lg:rounded-3xl p-4 max-h-[calc(100vh-20rem)] lg:max-h-[calc(100vh-40rem)] min-h-[400px] overflow-hidden overflow-y-auto"
                >
                  <p>
                    <strong>คำนิยาม</strong>
                  </p>
                  <ol className="list-decimal list-inside ml-4">
                    <li>
                      &ldquo;<strong>สภาเภสัชกรรม</strong>&rdquo; หมายถึง สภาเภสัชกรรมแห่งประเทศไทย
                    </li>
                    <li>
                      &ldquo;<strong>การประชุม</strong>&rdquo; หมายถึง
                      การประชุมสภาเภสัชกรรมที่ได้มีการถ่ายทอดผ่านระบบอิเล็กทรอนิกส์
                    </li>
                    <li>
                      &ldquo;<strong>ผู้เข้าร่วมประชุม</strong>&rdquo; หมายถึง
                      บุคลากรที่ทางกรรมการสภาเภสัชกรรมอนุญาตให้เข้าร่วมรับชมการถ่ายทอดสดการประชุม
                    </li>
                    <li>
                      &ldquo;<strong>ข้อมูลความลับ</strong>&rdquo; หมายถึง ข้อมูลใดๆ
                      ที่ไม่ได้เปิดเผยต่อสาธารณะและเป็นข้อมูลที่สภาเภสัชกรรมถือว่าเป็นความลับ
                      รวมถึงแต่ไม่จำกัดเพียง:
                    </li>
                    <p className="indent-8">
                      (ก)
                      มติที่ประชุมที่ยังไม่ได้ประกาศอย่างเป็นทางการหรือมติที่อยู่ระหว่างการพิจารณา
                    </p>
                    <p className="indent-8">
                      (ข)
                      ข้อมูลการพิจารณาจรรยาบรรณวิชาชีพการร้องเรียนหรือการสอบสวนทางจรรยาบรรณที่ยังไม่มีข้อยุติ
                    </p>
                    <p className="indent-8">
                      (ค) ข้อมูลส่วนบุคคลของสมาชิกหรือผู้เกี่ยวข้องในกระบวนการพิจารณาของสภาเภสัชกรรม
                    </p>
                    <p className="indent-8">
                      (ง)
                      รายละเอียดการอภิปรายความเห็นหรือข้อเสนอแนะของกรรมการหรือผู้เข้าร่วมประชุมแต่ละท่านที่ไม่ได้ระบุไว้ในมติที่ประชุมอย่างเป็นทางการ
                    </p>
                    <p className="indent-8">
                      (จ) ข้อมูลทางการเงินแผนงบประมาณหรือการดำเนินการที่อยู่ระหว่างการพิจารณา
                    </p>
                    <p className="indent-8">
                      (ฉ)
                      ข้อมูลเกี่ยวกับการสอบและการวัดผลความรู้ความสามารถในวิชาชีพเภสัชกรรมที่ยังไม่ประกาศอย่างเป็นทางการ
                    </p>
                    <p className="indent-8">
                      (ช)
                      เอกสารประกอบการประชุมที่ระบุว่าเป็นเอกสารลับหรือเอกสารที่ใช้เฉพาะภายในการประชุม
                    </p>
                    <p className="indent-8">
                      (ซ)
                      แผนยุทธศาสตร์แผนพัฒนาหรือนโยบายที่อยู่ระหว่างการพิจารณาและยังไม่ได้ประกาศใช้
                    </p>
                    <p className="indent-8">
                      (ฌ)
                      ข้อมูลอื่นใดที่ประธานในที่ประชุมหรือสภาเภสัชกรรมระบุว่าเป็นความลับในระหว่างการประชุม
                    </p>
                    <li>
                      &ldquo;<strong>ข้อมูลส่วนบุคคล</strong>&rdquo; หมายถึง
                      ข้อมูลเกี่ยวกับบุคคลซึ่งทำให้สามารถระบุตัวบุคคลนั้นได้ไม่ว่าทางตรงหรือทางอ้อม
                      ตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562
                      ซึ่งในบริบทของการประชุมสภาเภสัชกรรม อาจรวมถึงแต่ไม่จำกัดเพียง:
                    </li>
                    <p className="indent-8">
                      (ก) ชื่อ-นามสกุลเลขประจำตัวประชาชนหมายเลขใบประกอบวิชาชีพเภสัชกรรม
                    </p>
                    <p className="indent-8">
                      (ข)
                      ที่อยู่หมายเลขโทรศัพท์อีเมลหรือข้อมูลการติดต่ออื่นๆของสมาชิกหรือบุคคลที่เกี่ยวข้อง
                    </p>
                    <p className="indent-8">
                      (ค) ข้อมูลทางการแพทย์สุขภาพหรือความพิการของบุคคลที่อาจมีการกล่าวถึงในที่ประชุม
                    </p>
                    <p className="indent-8">
                      (ง) ประวัติการศึกษาการทำงานหรือข้อมูลวิชาชีพที่เฉพาะเจาะจงของบุคคล
                    </p>
                    <p className="indent-8">
                      (จ)
                      ข้อมูลการลงโทษทางวินัยการพิจารณาความผิดทางจรรยาบรรณหรือคดีความที่เกี่ยวข้องกับบุคคล
                    </p>
                    <p className="indent-8">
                      (ฉ)
                      ข้อมูลการเงินรายได้หรือฐานะทางการเงินของบุคคลที่อาจมีการกล่าวถึงในที่ประชุม
                    </p>
                    <p className="indent-8">
                      (ช) ความคิดเห็นหรือทัศนคติส่วนบุคคลที่อาจระบุถึงตัวบุคคลได้
                    </p>
                    <p className="indent-8">
                      (ซ) ภาพถ่ายบันทึกเสียงหรือวิดีโอที่สามารถระบุตัวบุคคลได้
                    </p>
                    <p className="indent-8">
                      (ฌ) ข้อมูลอื่นใดที่สามารถระบุตัวบุคคลได้ไม่ว่าทางตรงหรือทางอ้อม
                      หรือข้อมูลที่เมื่อนำมาประมวลผลร่วมกับข้อมูลอื่นแล้วสามารถระบุตัวบุคคลได้
                    </p>
                    <li>
                      <strong>&ldquo;</strong>
                      <strong>การปฏิบัติตามกฎหมายที่เกี่ยวข้อง</strong>
                      <strong>&rdquo;</strong>หมายถึง
                      การปฏิบัติตนในการเข้าประชุมและการดำเนินการเรื่องข้อมูลในการประชุมให้เป็นไปตามกฎหมายที่เกี่ยวข้อง
                      อาจรวมถึงแต่ไม่จำกัดเพียง ประมวลกฎหมายอาญาว่าด้วยเรื่องละเมิดและหมิ่นประมาท
                      พระราชบัญญํติการคุ้มครองข้อมูลส่วนบุคคล
                      พระราชบัญญัติข้อมูลข่าวสารของราชการพระราชบัญญัติว่าด้วยการกระทำความผิดเกี่ยวกับคอมพิวเตอร์
                    </li>
                  </ol>
                  <p className="ml-4">
                    <strong>วัตถุประสงค์</strong>
                  </p>
                  <p className="ml-4">
                    สภาเภสัชกรรมมีความมุ่งมั่นในการสร้างความสามัคคีส่งเสริมการปฏิบัติตามหลักจรรยาบรรณที่ดีระหว่างผู้ประกอบวิชาชีพด้วยกันเพื่อผดุงเกียรติภูมิแห่งวิชาชีพการถ่ายทอดสดการประชุมสภาเภสัชกรรมนับว่าเป็นกิจกรรมริเริ่มใหม่ที่มีวัตถุประสงค์เพื่อส่งเสริมความโปร่งใสในการดำเนินงานของสภาเภสัชกรรมและเพื่อให้ผู้เข้าร่วมประชุมได้รับทราบข้อมูลการประชุมอย่างทั่วถึงซึ่งการปฏิบัติตนในการเข้าประชุมและการดำเนินการเรื่องข้อมูลในการประชุมให้เป็นไปตามกฎหมายที่เกี่ยวข้องต้องอยู่ภายใต้ข้อกำหนดและเงื่อนไขฉบับนี้เพื่อรักษาความลับความปลอดภัยของข้อมูลและเพื่อป้องกันการนำข้อมูลไปใช้โดยมิชอบหรือผิดหลักจรรยาบรรณวิชาชีพหรือส่งผลกระทบต่อความสามัคคี/เกียรติภูมิแห่งวิชาชีพ
                  </p>
                  <p>
                    <strong>ข้อกำหนดและเงื่อนไขในการเข้าร่วมประชุม</strong>
                  </p>
                  <ol className="list-decimal list-inside ml-4">
                    <li>
                      <strong>การเข้าถึงการถ่ายทอดสด</strong>
                    </li>
                    <ol className="list-inside ml-4">
                      <li>
                        1.1.ผู้เข้าร่วมประชุมต้องเป็นบุคลากรของสภาเภสัชกรรมที่ได้รับอนุญาตให้เข้าร่วมรับชมการถ่ายทอดสดเท่านั้น
                        โดยการได้รับอนุญาตดังกล่าวต้องเป็นไปตามประกาศหรือคำสั่งของสภาเภสัชกรรมที่ระบุไว้อย่างชัดเจน
                        ซึ่งอาจมีการกำหนดตามตำแหน่งหน้าที่ ความรับผิดชอบ
                        หรือเหตุผลความจำเป็นอื่นใดที่สภาเภสัชกรรมเห็นสมควร
                      </li>
                      <li>
                        1.2.ผู้เข้าร่วมประชุมจะต้องเข้าสู่ระบบด้วยบัญชีผู้ใช้งานส่วนบุคคล (Personal
                        Account) ที่สภาเภสัชกรรมกำหนดและจัดสรรให้เท่านั้นและต้องปฏิบัติดังนี้
                      </li>
                      <div className="ml-4">
                        <p>(ก) เก็บรักษารหัสผ่าน (Password) ไว้เป็นความลับส่วนบุคคล</p>
                        <p>
                          (ข)
                          ห้ามมิให้เปิดเผยแบ่งปันหรือให้ยืมรหัสผ่านหรือข้อมูลการเข้าถึงแก่บุคคลอื่นโดยเด็ดขาดไม่ว่าจะเป็นบุคลากรในสภาเภสัชกรรมหรือบุคคลภายนอก
                        </p>
                        <p>(ค) ห้ามใช้บัญชีเดียวกันในการเข้าสู่ระบบพร้อมกันจากหลายอุปกรณ์</p>
                        <p>
                          (ง) ทำการออกจากระบบ (Log out)
                          ทุกครั้งเมื่อไม่ได้ใช้งานหรือเมื่อสิ้นสุดการประชุม
                        </p>
                        <p>
                          (จ)
                          แจ้งผู้ดูแลระบบทันทีหากพบหรือสงสัยว่ามีการใช้งานบัญชีโดยไม่ได้รับอนุญาต
                        </p>
                      </div>
                      <li>
                        1.3.ผู้เข้าร่วมประชุมรับทราบและยินยอมว่าระบบจะทำการบันทึกและจัดเก็บข้อมูลต่างๆ
                        เกี่ยวกับการใช้งานระบบ ซึ่งรวมถึงแต่ไม่จำกัดเพียง
                        เวลาที่เข้าสู่ระบบและออกจากระบบ (Login/Logout Timestamp) ที่อยู่ IP (IP
                        Address) และข้อมูลอุปกรณ์ (Device Information) ที่ใช้ในการเข้าถึง
                        พฤติกรรมการใช้งานระบบ (User Behavior) ระหว่างการรับชมการถ่ายทอดสด
                        การดำเนินการใดๆ ในระบบ เช่น การคลิก การดาวน์โหลด หรือการใช้ฟังก์ชันต่างๆ
                        ตลอดจนระยะเวลาในการรับชมการถ่ายทอดสดและช่วงเวลาที่มีการรับชม
                        ข้อมูลดังกล่าวอาจถูกนำมาใช้เพื่อการตรวจสอบในกรณีที่มีการละเมิดข้อกำหนดและเงื่อนไขนี้
                      </li>
                      <li>
                        1.4.ผู้เข้าร่วมประชุมจะต้องไม่อนุญาตหรือเปิดโอกาสให้บุคคลอื่นที่ไม่ได้รับอนุญาตรับชมการถ่ายทอดสดผ่านอุปกรณ์ของตน
                        โดย
                      </li>
                      <div className="ml-4">
                        <p>
                          (ก)
                          ต้องไม่นำอุปกรณ์ที่แสดงการถ่ายทอดสดไว้ในพื้นที่ที่บุคคลอื่นสามารถมองเห็นได้หรือต้องจัดวางในลักษณะที่มั่นใจได้ว่าจะไม่มีผู้อื่นมองเห็นเนื้อหาการประชุม
                        </p>
                        <p>
                          (ข)
                          ต้องไม่เปิดหรือแสดงการถ่ายทอดสดในพื้นที่สาธารณะหรือพื้นที่ที่มีบุคคลซึ่งไม่ได้รับอนุญาตอยู่ร่วมด้วย
                        </p>
                        <p>
                          (ค) ต้องไม่ถ่ายทอดหรือส่งต่อสัญญาณการถ่ายทอดสด (Stream)
                          ไปยังอุปกรณ์หรือหน้าจออื่นใด
                        </p>
                        <p>
                          (ง)
                          ต้องไม่ใช้อุปกรณ์เชื่อมต่อกับจอภาพสาธารณะหรือจอภาพขนาดใหญ่โดยไม่ได้รับอนุญาตเป็นลายลักษณ์อักษรจากสภาเภสัชกรรม
                        </p>
                      </div>
                    </ol>
                    <li>
                      <strong>ข้อห้ามในการบันทึก</strong>
                      <strong>เผยแพร่</strong>
                      <strong>และนำข้อมูลความลับและข้อมูลส่วนบุคคลไปใช้</strong>
                    </li>
                    <ol className="list-inside ml-4">
                      <li>
                        <strong> 2.1.</strong>ผู้เข้าร่วมประชุมตกลงที่จะไม่กระทำการใดๆ ดังต่อไปนี้:
                        <p>(ก) การบันทึกเนื้อหาการประชุมซึ่งอาจมีข้อมูลความลับและข้อมูลส่วนบุคคล</p>
                        <ul className="list-disc list-inside ml-4">
                          <li>
                            บันทึกภาพหน้าจอ (Screenshot) ไม่ว่าจะโดยใช้ฟังก์ชันของระบบปฏิบัติการ
                            แอปพลิเคชัน หรืออุปกรณ์อื่นใด
                            เนื่องจากอาจมีการแสดงข้อมูลความลับหรือข้อมูลส่วนบุคคลในหน้าจอดังกล่าว
                          </li>
                          <li>
                            บันทึกวิดีโอหรือเสียงของการประชุม ไม่ว่าจะโดยใช้ซอฟต์แวร์บันทึกหน้าจอ
                            (Screen Recording Software) อุปกรณ์บันทึกภาพหรือเสียงภายนอก (เช่น กล้อง
                            โทรศัพท์มือถือ เครื่องบันทึกเสียง) หรือวิธีการอื่นใด
                            ซึ่งอาจเป็นการละเมิดข้อมูลความลับและข้อมูลส่วนบุคคลที่มีการนำเสนอหรืออภิปรายในที่ประชุม
                          </li>
                          <li>
                            ใช้เทคโนโลยีการแปลงเสียงเป็นข้อความ (Speech-to-Text)
                            หรือเทคโนโลยีการรู้จำภาพ (Image Recognition)
                            เพื่อบันทึกหรือประมวลผลเนื้อหาการประชุมซึ่งอาจมีข้อมูลความลับและข้อมูลส่วนบุคคล
                          </li>
                        </ul>
                        <p>(ข) การคัดลอกหรือจดบันทึกข้อมูลความลับและข้อมูลส่วนบุคคล</p>
                        <ul className="list-disc list-inside ml-4">
                          <li>
                            คัดลอกข้อความ ตาราง กราฟ
                            หรือข้อมูลอื่นใดที่มีลักษณะเป็นข้อมูลความลับหรือข้อมูลส่วนบุคคลที่ปรากฏในระหว่างการประชุม
                          </li>
                          <li>
                            จดบันทึกข้อมูลความลับหรือข้อมูลส่วนบุคคลที่มีการนำเสนอหรืออภิปรายในระหว่างการประชุม
                            โดยไม่ได้รับอนุญาตเป็นลายลักษณ์อักษรจากสภาเภสัชกรรม
                          </li>
                          <li>
                            ถ่ายภาพเอกสารหรือสื่อนำเสนอที่มีข้อมูลความลับหรือข้อมูลส่วนบุคคลที่ใช้ในการประชุม
                            ไม่ว่าจะโดยใช้อุปกรณ์ใดก็ตาม
                          </li>
                        </ul>
                        <p>(ค) การเผยแพร่ข้อมูลความลับและข้อมูลส่วนบุคคล</p>
                        <ul className="list-disc list-inside ml-4">
                          <li>
                            เผยแพร่ข้อมูลความลับหรือข้อมูลส่วนบุคคลที่ได้รับทราบจากการประชุมต่อบุคคลภายนอก
                            ไม่ว่าจะผ่านช่องทางใดก็ตาม รวมถึงแต่ไม่จำกัดเพียง สื่อสังคมออนไลน์
                            (Social Media) เช่น Facebook, Twitter, Instagram, LINE, TikTok, YouTube
                            หรือแพลตฟอร์มอื่นใด กลุ่มไลน์ (LINE Group) หรือกลุ่มสนทนาอื่นๆ
                            แม้จะเป็นกลุ่มเฉพาะวิชาชีพ การประชุม สัมมนา หรือการบรรยายอื่นๆ บล็อก
                            เว็บไซต์ หรือสื่อออนไลน์อื่นๆ สื่อสิ่งพิมพ์ วิทยุ โทรทัศน์
                            หรือสื่อมวลชนอื่นๆ ตลอดจนการสนทนาส่วนตัว ทั้งแบบเผชิญหน้า (Face-to-Face)
                            ทางโทรศัพท์ หรือผ่านแอปพลิเคชันสื่อสาร
                          </li>
                          <li>
                            อ้างอิงหรือเปิดเผยความเห็นหรือข้อเสนอแนะของกรรมการหรือผู้เข้าร่วมประชุมรายบุคคล
                            โดยระบุชื่อหรือในลักษณะที่สามารถระบุตัวบุคคลได้
                          </li>
                          <li>
                            นำเสนอข้อมูลในลักษณะที่อาจทำให้เข้าใจผิดว่าเป็นการเปิดเผยจากสภาเภสัชกรรมอย่างเป็นทางการ
                          </li>
                        </ul>
                        <p>(ง) การบิดเบือนข้อมูลหรือสร้างข้อมูลเท็จ</p>
                        <ul className="list-disc list-inside ml-4">
                          <li>
                            เผยแพร่ข้อความ ภาพ หรือสื่อใดๆ
                            ที่มีเนื้อหาเป็นเท็จหรือบิดเบือนเกี่ยวกับการประชุม
                          </li>
                          <li>
                            ดัดแปลง ตัดต่อ
                            หรือแก้ไขข้อมูลจากการประชุมในลักษณะที่อาจทำให้เกิดความเข้าใจผิด
                          </li>
                          <li>
                            นำเสนอความเห็นส่วนตัวในลักษณะที่อาจทำให้เข้าใจผิดว่าเป็นมติหรือความเห็นของที่ประชุม
                          </li>
                          <li>
                            สร้างข่าวลวงหรือกระจายข้อมูลที่ยังไม่ได้รับการยืนยันเกี่ยวกับมติหรือการตัดสินใจของสภาเภสัชกรรม
                          </li>
                        </ul>
                        <p>(จ) การใช้ข้อมูลในทางที่เป็นอันตราย</p>
                        <ul className="list-disc list-inside ml-4">
                          <li>
                            ใช้ข้อมูลที่ได้รับจากการประชุมไปในทางที่ก่อให้เกิดความเสียหายแก่สภาเภสัชกรรม
                            หรือเจ้าของข้อมูลส่วนบุคคล
                            ซึ่งอาจเป็นการละเมิดพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562
                            และกฎหมายอื่นที่เกี่ยวข้อง
                          </li>
                          <li>
                            ประมวลผลข้อมูลส่วนบุคคลที่ได้รับจากการประชุมโดยไม่ได้รับความยินยอมจากเจ้าของข้อมูล
                            ซึ่งเป็นการละเมิดพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562
                          </li>
                          <li>
                            ใช้ข้อมูลเพื่อแสวงหาผลประโยชน์ส่วนตัวหรือประโยชน์ทางธุรกิจที่ไม่เหมาะสม
                          </li>
                          <li>
                            ใช้ข้อมูลในการกระทำที่ผิดกฎหมาย ผิดจรรยาบรรณวิชาชีพ
                            หรือขัดต่อนโยบายของสภาเภสัชกรรม
                          </li>
                          <li>
                            ใช้ข้อมูลเพื่อก่อให้เกิดความแตกแยก ความเข้าใจผิด
                            หรือความขัดแย้งในหมู่สมาชิกหรือวิชาชีพเภสัชกรรม
                          </li>
                        </ul>
                      </li>
                      <li>
                        <strong> 2.2.</strong>การเผยแพร่ข้อมูลอย่างเป็นทางการ
                        <p>
                          (ก)
                          ผู้เข้าร่วมประชุมรับทราบว่าข้อมูลที่เป็นมติที่ประชุมจะถูกเผยแพร่อย่างเป็นทางการโดยสภาเภสัชกรรมในช่องทางที่เหมาะสมเท่านั้นและผู้เข้าร่วมประชุมไม่มีสิทธิ์ในการเผยแพร่มติดังกล่าวก่อนการประกาศอย่างเป็นทางการ
                        </p>
                        <p>
                          (ข)
                          การเผยแพร่มติที่ประชุมอย่างเป็นทางการจะดำเนินการโดยผู้มีหน้าที่รับผิดชอบโดยตรงเท่านั้นตามช่องทางและรูปแบบที่สภาเภสัชกรรมกำหนด
                        </p>
                        <p>
                          (ค) ในกรณีที่มีข้อสงสัยว่าข้อมูลใดสามารถเปิดเผยได้หรือไม่
                          ผู้เข้าร่วมประชุมต้องสอบถามและได้รับการยืนยันเป็นลายลักษณ์อักษรจากเลขาธิการสภาเภสัชกรรมหรือผู้ที่ได้รับมอบหมายก่อนเท่านั้น
                        </p>
                      </li>
                    </ol>
                    <li>
                      <strong>ระบบความปลอดภัยและการติดตามการละเมิดข้อมูล</strong>
                    </li>
                    <ol className="list-inside ml-4">
                      <li>
                        3.1.ผู้เข้าร่วมประชุมรับทราบว่า
                        ระบบถ่ายทอดสดของสภาเภสัชกรรมมีการติดตั้งเทคโนโลยีการป้องกันการบันทึกภาพหน้าจอและการติดตามการใช้งาน
                        เพื่อป้องกันการละเมิดข้อมูลความลับและข้อมูลส่วนบุคคล
                        โดยผู้เข้าร่วมประชุมรับทราบและยินยอมโดยชัดแจ้งว่า
                        หากมีการบันทึกภาพหน้าจอหรือการคัดลอกข้อมูลใดๆ จากการประชุม ระบบจะสร้างลายน้ำ
                        (Watermark) ที่แสดงชื่อผู้ใช้งานและรหัสเฉพาะโดยอัตโนมัติ
                        เพื่อให้สามารถตรวจสอบและติดตามแหล่งที่มาของการรั่วไหลของข้อมูลความลับและข้อมูลส่วนบุคคลได้
                      </li>
                      <li>
                        3.2.ผู้เข้าร่วมประชุมรับทราบว่า
                        การสร้างลายน้ำดังกล่าวมีวัตถุประสงค์เพื่อป้องกันการรั่วไหลของข้อมูลความลับและข้อมูลส่วนบุคคล
                        มิใช่เพื่อเผยแพร่ชื่อของผู้เข้าร่วมประชุมต่อสาธารณะ
                        และจะถูกใช้เฉพาะในกรณีที่มีการสืบสวนการละเมิดข้อกำหนดและเงื่อนไขนี้เท่านั้น
                      </li>
                      <li>
                        3.3.ผู้เข้าร่วมประชุมรับทราบและยินยอมว่า
                        สภาเภสัชกรรมอาจดำเนินการตรวจสอบและติดตามกรณีที่สงสัยว่ามีการละเมิดข้อมูลความลับหรือข้อมูลส่วนบุคคล
                        โดยอาจใช้วิธีการทางเทคนิคต่างๆ ซึ่งรวมถึงแต่ไม่จำกัดเพียง:
                      </li>
                      <ol className="list-inside ml-4">
                        <li>(1)การตรวจสอบบันทึกการใช้งานระบบ (Log Files)</li>
                        <li>(2)การติดตามลายน้ำดิจิทัลที่ฝังอยู่ในเนื้อหาที่พบการรั่วไหล</li>
                      </ol>
                    </ol>
                    <li>
                      <strong>ความรับผิดและบทลงโทษ</strong>
                    </li>
                    <ol className="list-inside ml-4">
                      <li>
                        4.1.ผู้เข้าร่วมประชุมรับทราบว่า การฝ่าฝืนข้อกำหนดและเงื่อนไขนี้อาจนำไปสู่:
                        <ol className="list-inside ml-4">
                          <li>(1)การระงับสิทธิ์ในการเข้าร่วมการประชุมในครั้งนี้หรือครั้งต่อไป</li>
                          <li>(2)การดำเนินการทางวินัยตามระเบียบของสภาเภสัชกรรม</li>
                          <li>
                            (3)การดำเนินคดีทางแพ่งหรือทางอาญา
                            ในกรณีที่การฝ่าฝืนก่อให้เกิดความเสียหายหรือเป็นการกระทำที่ผิดกฎหมาย
                          </li>
                          <li>
                            (4)การเรียกร้องค่าเสียหายจากการกระทำที่ฝ่าฝืนข้อกำหนดและเงื่อนไขนี้
                          </li>
                        </ol>
                      </li>
                      <li>
                        4.2.ในกรณีที่ผู้เข้าร่วมประชุมเผยแพร่ข้อมูลส่วนบุคคล
                        ซึ่งเป็นการละเมิดพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562
                        ผู้เข้าร่วมประชุมอาจมีความรับผิดทั้งทางแพ่งและอาญา
                      </li>
                      <li>
                        4.3.ในกรณีที่ผู้เข้าร่วมประชุมเผยแพร่ข้อมูลเท็จหรือบิดเบือนเกี่ยวกับการประชุม
                        ซึ่งก่อให้เกิดความเสียหายต่อชื่อเสียงของสภาเภสัชกรรมหรือบุคคลที่เกี่ยวข้อง
                        ผู้เข้าร่วมประชุมอาจมีความรับผิดฐานหมิ่นประมาทตามประมวลกฎหมายอาญา
                        และ/หรือความผิดตามพระราชบัญญัติว่าด้วยการกระทำผิดเกี่ยวกับคอมพิวเตอร์ พ.ศ.
                        2550
                      </li>
                    </ol>
                    <li>
                      <strong>การรายงานเหตุละเมิด</strong>
                      <ol className="list-inside ml-4">
                        <li>
                          5.1.ผู้เข้าร่วมประชุมที่พบเห็นการละเมิดข้อกำหนดและเงื่อนไขนี้
                          สามารถรายงานมายังเจ้าหน้าที่สภาเภสัชกรรมที่รับผิดชอบได้โดยทันที
                          โดยสภาเภสัชกรรมจะรักษาความลับของผู้รายงานและจะดำเนินการตรวจสอบข้อร้องเรียนอย่างเหมาะสม
                        </li>
                      </ol>
                    </li>
                    <li>
                      <strong>ข้อกำหนดทั่วไป</strong>
                    </li>
                    <ol className="list-inside ml-4">
                      <li>6.1.ข้อกำหนดและเงื่อนไขนี้อยู่ภายใต้กฎหมายไทย</li>
                      <li>
                        6.2.หากข้อกำหนดและเงื่อนไขข้อใดข้อหนึ่งไม่สามารถบังคับใช้ได้
                        ข้อกำหนดและเงื่อนไขที่เหลือยังคงมีผลบังคับใช้ต่อไป
                      </li>
                      <li>
                        6.3.การที่สภาเภสัชกรรมไม่บังคับใช้สิทธิหรือบทบัญญัติใดๆ
                        ตามข้อกำหนดและเงื่อนไขนี้ ไม่ถือว่าเป็นการสละสิทธิในการบังคับใช้ในอนาคต
                      </li>
                      <li>
                        6.4.สภาเภสัชกรรมขอสงวนสิทธิ์ในการแก้ไขข้อกำหนดและเงื่อนไขนี้ได้ตามความเหมาะสม
                        โดยจะแจ้งให้ผู้เข้าร่วมประชุมทราบล่วงหน้า
                      </li>
                    </ol>
                  </ol>
                  <p>
                    <strong>การยอมรับข้อกำหนดและเงื่อนไข</strong>
                  </p>
                  <p className="indent-4">
                    การคลิก &quot;ยอมรับ&quot; ถือเป็นการที่ผู้เข้าร่วมประชุมได้อ่าน เข้าใจ
                    และตกลงที่จะปฏิบัติตามข้อกำหนดและเงื่อนไขทั้งหมดที่ระบุไว้ในเอกสารนี้
                    หากผู้เข้าร่วมประชุมไม่ยอมรับข้อกำหนดและเงื่อนไขนี้
                    ผู้เข้าร่วมประชุมจะไม่สามารถเข้าร่วมการประชุมแบบถ่ายทอดสดได้
                  </p>
                  <p className="indent-4">
                    ข้าพเจ้าได้อ่านและเข้าใจข้อกำหนดและเงื่อนไขในการเข้าร่วมประชุมสภาเภสัชกรรมแบบถ่ายทอดสด
                    (Live Streaming) ทั้งหมดแล้ว
                    และตกลงที่จะปฏิบัติตามข้อกำหนดและเงื่อนไขดังกล่าวทุกประการ
                  </p>
                  <div
                    onClick={scrollToRef}
                    className="grid cursor-pointer place-content-center fixed bottom-[11rem] md:bottom-[7rem] lg:bottom-[8rem] right-8 w-14 aspect-square rounded-full bg-[#464646]"
                  >
                    <ArrowDown size={32} color="white" />
                  </div>
                </div>
                <DialogFooter className="flex gap-4 lg:gap-8 !place-self-center !justify-center w-full font-semibold">
                  <DialogClose
                    onClick={() => {
                      setIsOk(false);
                    }}
                    className="grow lg:grow-0 border w-full lg:w-[305px] p-4 rounded-2xl lg:text-2xl text-[#23260D]"
                  >
                    <span>ไม่ยินยอม</span>
                  </DialogClose>
                  <button
                    disabled={!isOk}
                    onClick={() => {
                      router.push("/login");
                    }}
                    className={`border grow lg:flex-grow-0 lg:w-[305px] p-4 rounded-2xl lg:text-2xl text-[#ffffff] ${isOk ? "cursor-pointer bg-gradient-to-r from-[#80862A] to-[#4F5321]" : "cursor-not-allowed disabled:opacity-50 disabled:bg-[#C1C457]"}`}
                  >
                    <span>ยินยอม</span>
                  </button>
                </DialogFooter>
              </DialogContent>
            </Dialog>
            <p className="text-[10px] md:text-[12px] text-[#23260D] text-center">
              สำนักงานเลขาธิการสภาเภสัชกรรม
              <br />
              เลขที่ 88/19 หมู่ 4 ถนนติวานนท์ ตำบลตลาดขวัญ อำเภอเมือง จังหวัดนนทบุรี 11000
              <br />
              โทรศัพท์ 02-591-9992 Email: pharthai@pharmacycouncil.org
            </p>
          </div>
        </div>
      </Wrapper>
    </>
  );
}
